// Маркеры данных
const markersData = [
    {
        id: 1,
        coords: [56.86113108092801, 53.17586856845352],
        name: "Парк Культуры и Отдыха имени Кирова",
        description: "",
        category: "Парк",
        address: "Удмуртская Республика, г. Ижевск, ул. Кирова, 8-а"
    },
    {
        id: 2,
        coords: [56.85368486399105, 53.2189401954412],
        name: "Сквер Карлутской площади",
        description: "",
        category: "Сквер",
        address: "Удмуртская Республика, г. Ижевск, Карлутская площадь"
    },
    {
        id: 3,
        coords: [56.86362520902421, 53.27946578929785],
        name: "Сквер им. Татьяны Барамзиной",
        description: "",
        category: "Сквер",
        address: "Удмуртская Республика, г. Ижевск, ул. Труда, 48"
    },
    {
        id: 4,
        coords: [56.850563208267545, 53.19531171447617],
        name: "Сквер на Набережной Ижевского пруда",
        description: "",
        category: "Сквер",
        address: "Удмуртская Республика, г. Ижевск, наб. Зодчего Дудина"
    },
    {
        id: 5,
        coords: [56.842524236481424, 53.21795916536055],
        name: "Птичий сквер",
        description: "",
        category: "Сквер",
        address: "Удмуртская Республика, г. Ижевск, ул. Пушкинская, 158 и ул. Коммунаров, 191а"
    },
    {
        id: 6,
        coords: [56.86116292170031, 53.20887910528223],
        name: "Вишневый сквер",
        description: "",
        category: "Сквер",
        address: "Удмуртская Республика, г. Ижевск, ул. Пушкинская, 268"
    },
    {
        id: 7,
        coords: [56.86688784436081, 53.21169884146559],
        name: "Открытый сад",
        description: "",
        category: "Сад",
        address: "Удмуртская Республика, г. Ижевск, ул. Пушкинская, 276"
    },
    {
        id: 8,
        coords: [56.86856853314001, 53.29022940283024],
        name: "Сквер Молодоженов",
        description: "",
        category: "Сквер",
        address: "Удмуртская Республика, г. Ижевск, ул. Михаила Петрова, 33"
    },
        {
        id: 9,
        coords: [56.876658463268775, 53.19241477768947],
        name: "Сквер им. В.С.Тарасова",
        description: "",
        category: "Сквер",
        address: "Удмуртская Республика, г. Ижевск, ул. 50 лет ВЛКСМ"
    },
    {
        id: 10,
        coords: [56.80884229490635, 53.18997651317826],
        name: "Сквер им. Титова",
        description: "",
        category: "Сквер",
        address: "Удмуртская Республика, г. Ижевск, ул. Титова, 4"
    },
    {
        id: 11,
        coords: [56.86581131938815, 53.20997764146552],
        name: "Сквер им.Шувалова П.И.",
        description: "",
        category: "Сквер",
        address: "Удмуртская Республика, г. Ижевск, ул. Пушкинская, 276"
    },
    {
        id: 12,
        coords: [56.87684105100032, 53.184120150701176],
        name: "Сквер Металлургов",
        description: "",
        category: "Сквер",
        address: "Удмуртская Республика, г. Ижевск, ул. Школьная, 44"
    },
    {
        id: 13,
        coords: [56.85835682273732, 53.194457032899535],
        name: "Парк Патриот",
        description: "",
        category: "Парк",
        address: "Удмуртская Республика, г. Ижевск, ул. Кирова, 17"
    },
    {
        id: 14,
        coords: [56.844389654451085, 53.217356599075494],
        name: "Сквер Нефтяников",
        description: "",
        category: "Сквер",
        address: "Удмуртская Республика, г. Ижевск, ул. Ленина, 30-42"
    },
    {
        id: 15,
        coords: [56.873565963076516, 53.25460751257125],
        name: "Рябиновый сквер",
        description: "",
        category: "Сквер",
        address: "Удмуртская Республика, г. Ижевск, ул. 9 Января, дома №163 - 183а (Индустр.р-н.)."
    },
    {
        id: 16,
        coords: [56.834190, 53.153208],
        name: "Заречный сквер",
        description: "",
        category: "Сквер",
        address: "Удмуртская Республика, г. Ижевск, ул. Телегина, 54 а, (Ленинский р-н.)."
    },
    {
        id: 17,
        coords: [56.8829, 53.2148],
        name: "Холмогоровский лес",
        description: "",
        category: "Лес",
        address: "Удмуртская Республика, г. Ижевск, ул. Студенческая, 42"
    },
    {
        id: 18,
        coords: [56.861756, 53.213395],
        name: "Сквер у театра 'Молодой человек'",
        description: "",
        category: "Сквер",
        address: "Удмуртская Республика, г. Ижевск, ул. Милиционная, 103"
    },
    {
        id: 19,
        coords: [56.860735990727164, 53.18308686839309],
        name: "Бульвар имени А. В. Воскресенского",
        description: "",
        category: "Бульвар",
        address: "Удмуртская Республика, г. Ижевск, ул. 50 лет Пионерии"
    },
    {
        id: 20,
        coords: [56.887795601960185, 53.248173361050945],
        name: "Парк Космонавтов",
        description: "",
        category: "Парк",
        address: "Удмуртская Республика, г. Ижевск, Воткинское ш., 91а"
    },
    {
        id: 21,
        coords: [56.85848006430621, 53.232713946882285],
        name: "Козий парк",
        description: "",
        category: "Парк",
        address: "Удмуртская Республика, г. Ижевск, Берёзовая роща"
    },
    {
        id: 22,
        coords: [56.84747664494854, 53.198183388277826],
        name: "Летний сад им. М.Горького",
        description: "",
        category: "Парк",
        address: "Удмуртская Республика, г. Ижевск, ул. Милиционная, 4"
    },
    {
        id: 23,
        coords: [56.86936993002722, 53.304070301576154],
        name: "Парк Тишино",
        description: "",
        category: "Парк",
        address: "Удмуртская Республика, г. Ижевск, ул. Берша, 32"
    },
    {
        id: 24,
        coords: [56.82289801165921, 53.13666028927663],
        name: "Парк Драгунова",
        description: "",
        category: "Парк",
        address: "Удмуртская Республика, г. Ижевск, ул. Оружейника Драгунова, 34"
    },
    {
        id: 25,
        coords: [56.866404938228165, 53.16807954140616],
        name: "Парк Маугли",
        description: "",
        category: "Парк",
        address: "Удмуртская Республика, г. Ижевск, Воткинское ш., 118"
    },
    {
        id: 26,
        coords: [56.85020361064272, 53.227152143253136],
        name: "Сети-парк",
        description: "",
        category: "Парк",
        address: "Удмуртская Республика, г. Ижевск, ул. Университетская, 1/1"
    },
    {
        id: 27,
        coords: [56.85990599215834, 53.165247056190786],
        name: "Фэмили парк",
        description: "",
        category: "Парк",
        address: "Удмуртская Республика, г. Ижевск, ул. Кирова, 8Б"
    },
    {
        id: 28,
        coords: [56.84778634753005, 53.221456873936624],
        name: "Бульвар Гоголя",
        description: "",
        category: "Бульвар",
        address: "Удмуртская Республика, г. Ижевск, бульвар Гоголя"
    },
    {
        id: 29,
        coords: [56.84762781691322, 53.284613338999975],
        name: "Крымская аллея",
        description: "",
        category: "Аллея",
        address: "Удмуртская Республика, г. Ижевск, ул. Первомайская, 4"
    },
    {
        id: 30,
        coords: [56.91586851589016, 53.21453978980618],
        name: "Сосновый бор",
        description: "",
        category: "Бор",
        address: "Удмуртская Республика, г. Ижевск, Сосновый бор"
    },
    {
        id: 31,
        coords: [56.85761473269266, 53.264909977891935],
        name: "Лесопарковая зона вдоль ул. Бабушкина",
        description: "",
        category: "Лесопарковая зона",
        address: "Удмуртская Республика, г. Ижевск, Индустриальный район, вдоль улицы Бабушкина"
    },
    {
        id: 32,
        coords: [56.87091267294868, 53.23408556654565],
        name: "Тимирязевский лес",
        description: "",
        category: "Лес",
        address: "Удмуртская Республика, г. Ижевск, Индустриальный район"

    },
    {
        id: 33,
        coords: [56.846064, 53.221253],
        name: "Аллея Счастья",
        description: "",
        category: "Аллея",
        address: "Удмуртская Республика, г. Ижевск, пешеходный бульвар, соединяющий площадь 50-летия Октября с улицей Удмуртской"

    },
    {
        id: 34,
        coords: [56.878208, 53.219672],
        name: "Школьная аллея",
        description: "",
        category: "Аллея",
        address: "Удмуртская Республика, г. Ижевск, ул. Ленина, 168"

    },
    {
        id: 35,
        coords: [56.5058, 53.1219],
        name: "Сквер на территории у Свято-Михайловского собора (ранее Сквер Революции)",
        description: "",
        category: "Сквер",
        address: "Удмуртская Республика, г. Ижевск, ул. Карла Маркса, 222"

    },
    {
        id: 36,
        coords: [56.858125, 53.286157],
        name: "Елки-парк",
        description: "",
        category: "Парк",
        address: "Удмуртская Республика, г. Ижевск, ул. Труда, 88Б"

    },
    {
        id: 37,
        coords: [56.866248, 53.301668],
        name: "Чемошурский лес",
        description: "",
        category: "Лес",
        address: "Удмуртская Республика, г. Ижевск, Чемошурский лес"

    },
    {
        id: 38,
        coords: [56.8385, 53.2680],
        name: "Карлутский лес",
        description: "",
        category: "Лес",
        address: "Удмуртская Республика, г. Ижевск, Карлутский лес"

    },
    {
        id: 39,
        coords: [56.852200, 53.315850],
        name: "Ярушкинский парк",
        description: "",
        category: "Парк",
        address: "Удмуртская Республика, г. Ижевск, Ярушкинский парк"

    },
     {
        id: 40,
        coords: [56.872394324120785, 53.17507258753657],
        name: "Сквер имени Калашникова",
        description: "",
        category: "Сквер",
        address: "Удмуртская Республика, г. Ижевск, ул. Студенческая, 42"
    },
];

let currentMap = null;
let currentMarkers = [];

// Инициализация Яндекс.Карты
ymaps.ready(function() {
    currentMap = new ymaps.Map("custom-map", {
        center: [56.852775, 53.211483],
        zoom: 13,
        controls: ['zoomControl', 'fullscreenControl']
    });

    // Добавляем маркеры
    markersData.forEach(function(marker) {
        const placemark = new ymaps.Placemark(marker.coords, {
            balloonContentHeader: `<b style="color: #e11d48; font-size: 16px;">${marker.name}</b>`,
            balloonContentBody: `
                <strong>📍 Категория:</strong> ${marker.category}<br>

                <strong>📝 Описание:</strong> ${marker.description}<br>

                <strong>🏠 Адрес:</strong> ${marker.address}
            `,
            hintContent: marker.name
        }, {
            preset: 'islands#redIcon',
            openBalloonOnClick: true
        });
        
        currentMap.geoObjects.add(placemark);
        currentMarkers.push(placemark);
    });

    console.log('✅ Яндекс.Карта загружена, добавлено маркеров:', currentMarkers.length);
});